--[[
房间背景、地板、墙体配置
]]

--房间大小
Room_Size = cc.size(692,99)--坐标：x:[29,721]

Grid_Size = cc.size(90,90)

RoomBgs = {}
RoomBgs[1]=
    {
        bg = {{res="",x=0,y=0},},--房间背景(背景窗户随机其实是在有背景图的几张图随机抽取一张替换图片为窗户)
        wallLeftRight = {{res="",x=0,y=0},},--左右两侧墙壁
        floor = {{res="",x=0,y=0},},--地板
    }
    

--横跑房间配置
RoomBgs[1001]=
    {
        bg = {{res="",x=0,y=0},},--房间背景
        wallLeftRight = {{res="",x=0,y=0},},--左右两侧墙壁
        floor = {{res="",x=0,y=0},},--地板
        type = 0,   --横跑时的桥梁配置，0：水平方向一致，1：垂直方向一致，2：水平垂直均不一致
    }